Repository: Tilotiti/scanbar-menu
Catalog: ScanBarMenu/Localizable.xcstrings
Source language: en
Languages: de, es, fr, it, ja, zh_hans

source: About
de: Über
es: Acerca de
fr: À propos
ja: 概要
zh_hans: 关于

source: Configuration
de: Einstellungen
es: Configuración
ja: 設定
zh_hans: 设置

source: Configuration…
de: Einstellungen…
es: Configuración…
ja: 設定…
zh_hans: 设置…

source: Choose save folder
de: Ordner wählen
es: Elegir carpeta
fr: Choisir un dossier
it: Scegli cartella
ja: フォルダを選択
zh_hans: 选择文件夹

source: Save folder
de: Speicherordner
es: Carpeta de guardado
fr: Dossier d'enregistrement
it: Cartella di salvataggio
ja: 保存フォルダ
zh_hans: 保存文件夹

source: Where to save generated images.
de: Speicherort der generierten Bilder.
es: Dónde guardar las imágenes generadas.
fr: Où enregistrer les images générées.
it: Dove salvare le immagini generate.
ja: 生成画像の保存先。
zh_hans: 生成图像的保存位置。

source: Change
de: Ändern
es: Cambiar
fr: Modifier
it: Modifica
ja: 変更
zh_hans: 更改

source: Clear
de: Löschen
es: Borrar
fr: Effacer
it: Cancella
ja: クリア
zh_hans: 清除

source: Select
de: Auswählen
es: Seleccionar
fr: Choisir
it: Seleziona
ja: 選択
zh_hans: 选择

source: Open Configuration
de: Einstellungen öffnen
es: Abrir configuración
fr: Ouvrir la configuration
it: Apri configurazione
ja: 設定を開く
zh_hans: 打开设置

source: Save folder required
de: Speicherordner erforderlich
es: Carpeta de guardado requerida
fr: Dossier d'enregistrement requis
it: Cartella di salvataggio richiesta
ja: 保存フォルダが必要です
zh_hans: 需要保存文件夹

source: To save barcode images, choose a save folder in Configuration. Click the menu bar icon, then Configuration.
de: Um Barcode-Bilder zu speichern, wählen Sie einen Ordner in den Einstellungen. Klicken Sie auf das Symbol in der Menüleiste, dann auf Einstellungen.
es: Para guardar imágenes de códigos de barras, elija una carpeta en Configuración. Haga clic en el icono de la barra de menús y luego en Configuración.
fr: Pour enregistrer les images de codes-barres, choisissez un dossier dans Configuration. Cliquez sur l'icône de la barre de menu, puis sur Configuration.
it: Per salvare le immagini dei codici a barre, scegli una cartella in Configurazione. Clicca sull'icona della barra dei menu, poi su Configurazione.
ja: バーコード画像を保存するには、設定でフォルダを選択してください。メニューバーのアイコンをクリックし、設定を選びます。
zh_hans: 要保存条形码图像，请在设置中选择保存文件夹。点击菜单栏图标，然后点击设置。

source: Copy
de: Kopieren
es: Copiar
fr: Copier
ja: コピー
zh_hans: 复制

source: Copy the reference
de: Kopieren Sie die Referenz
es: Copie la referencia
fr: Copiez la référence
ja: 参照をコピー
zh_hans: 复制参考

source: Developed by
de: Entwickelt von
es: Desarrollado por
fr: Développé par
ja: 開発者
zh_hans: 开发者

source: Display format
de: Anzeigeformat
es: Formato de visualización
fr: Format d'affichage
ja: 表示形式
zh_hans: 显示格式

source: Display your barcodes and QR codes on screen with one click.
de: Zeigen Sie Ihre Barcodes und QR-Codes mit einem Klick auf dem Bildschirm an.
es: Muestre sus códigos de barras y códigos QR en pantalla con un solo clic.
fr: Affichez vos codes-barres et QR codes sur l'écran en un clic.
ja: ワンクリックでバーコードやQRコードを画面に表示します。
zh_hans: 一键在屏幕上显示您的条形码和二维码。

source: Download
de: Herunterladen
es: Descargar
fr: Télécharger
ja: ダウンロード
zh_hans: 下载

source: Ex. « %@ »
de: Z. B. « %@ »
es: Ej. « %@ »
ja: 例：「%@」
zh_hans: 例如：「%@」

source: Got it
de: Verstanden
es: Entendido
fr: Compris
ja: わかりました
zh_hans: 知道了

source: How does it work?
de: Wie funktioniert es?
es: ¿Cómo funciona?
fr: Comment ça marche ?
ja: 使い方
zh_hans: 如何使用？

source: How it works…
de: Wie funktioniert es…
es: Cómo funciona…
fr: Comment ça marche…
ja: 使い方…
zh_hans: 如何使用…

source: Add pattern
de: Muster hinzufügen
es: Añadir patrón
fr: Ajouter un motif
it: Aggiungi modello
ja: パターンを追加
zh_hans: 添加模式

source: Also matches:
de: Trifft auch zu:
es: También coincide:
fr: Correspond aussi :
it: Corrisponde anche:
ja: 他にも一致:
zh_hans: 还匹配：

source: Clipboard patterns
de: Zwischenablage-Muster
es: Patrones del portapapeles
fr: Motifs du presse-papiers
it: Modelli appunti
ja: クリップボードのパターン
zh_hans: 剪贴板模式

source: Enter a reference to test.
de: Geben Sie eine Referenz zum Testen ein.
es: Introduzca una referencia para probar.
fr: Saisissez une référence à tester.
it: Inserisci un riferimento da provare.
ja: テストする参照を入力してください。
zh_hans: 输入要测试的参考文本。

source: First matching pattern:
de: Erstes passendes Muster:
es: Primer patrón que coincide:
fr: Premier motif correspondant :
it: Primo modello corrispondente:
ja: 最初に一致したパターン:
zh_hans: 首个匹配模式：

source: Invalid regular expression
de: Ungültiger regulärer Ausdruck
es: Expresión regular no válida
fr: Expression régulière invalide
it: Espressione regolare non valida
ja: 無効な正規表現
zh_hans: 正则表达式无效

source: New pattern
de: Neues Muster
es: Nuevo patrón
fr: Nouveau motif
it: Nuovo modello
ja: 新しいパターン
zh_hans: 新模式

source: No pattern matches this reference.
de: Kein Muster passt zu dieser Referenz.
es: Ningún patrón coincide con esta referencia.
fr: Aucun motif ne correspond à cette référence.
it: Nessun modello corrisponde a questo riferimento.
ja: どのパターンにも一致しません。
zh_hans: 没有模式匹配此参考文本。

source: No patterns configured.
de: Keine Muster konfiguriert.
es: No hay patrones configurados.
fr: Aucun motif configuré.
it: Nessun modello configurato.
ja: パターンが設定されていません。
zh_hans: 未配置任何模式。

source: Patterns are tested top to bottom; the first match is used. The whole copied text (trimmed) must match the regex. Example: ^[0-9A-Z]{8,20}$
de: Muster werden von oben nach unten geprüft; das erste Treffer zählt. Der gesamte kopierte Text (getrimmt) muss zur Regex passen. Beispiel: ^[0-9A-Z]{8,20}$
es: Los patrones se prueban de arriba abajo; se usa el primero que coincida. Todo el texto copiado (sin espacios al inicio/fin) debe coincidir con la expresión regular. Ejemplo: ^[0-9A-Z]{8,20}$
fr: Les motifs sont testés de haut en bas ; le premier qui correspond est utilisé. Tout le texte copié (sans espaces en bordure) doit correspondre à la regex. Exemple : ^[0-9A-Z]{8,20}$
it: I modelli sono provati dall’alto in basso; vale il primo che corrisponde. Tutto il testo copiato (senza spazi ai bordi) deve corrispondere alla regex. Esempio: ^[0-9A-Z]{8,20}$
ja: 上から順に試し、最初に一致したパターンが使われます。コピーした全文（前後の空白を除く）が正規表現に一致する必要があります。例: ^[0-9A-Z]{8,20}$
zh_hans: 从上到下测试模式，使用第一个匹配的。复制的全文（去除首尾空格）须与正则表达式完全匹配。示例：^[0-9A-Z]{8,20}$

source: Reference to test
de: Zu testende Referenz
es: Referencia de prueba
fr: Référence à tester
it: Riferimento di prova
ja: テストする参照
zh_hans: 要测试的参考文本

source: Regular expression
de: Regulärer Ausdruck
es: Expresión regular
fr: Expression régulière
it: Espressione regolare
ja: 正規表現
zh_hans: 正则表达式

source: Shows which pattern matches first and all other matching patterns.
de: Zeigt, welches Muster zuerst passt, und alle weiteren passenden Muster.
es: Muestra qué patrón coincide primero y los demás que también coinciden.
fr: Indique le premier motif qui correspond et les autres motifs qui correspondent aussi.
it: Mostra quale modello corrisponde per primo e tutti gli altri che corrispondono.
ja: 最初に一致したパターンと、他に一致するパターンを表示します。
zh_hans: 显示首先匹配的模式以及所有其他匹配的模式。

source: Test a reference
de: Referenz testen
es: Probar una referencia
fr: Tester une référence
it: Prova un riferimento
ja: 参照をテスト
zh_hans: 测试参考文本

source: Max character limit
de: Maximale Zeichenanzahl
es: Límite máximo de caracteres
fr: Limite de caractères max
ja: 最大文字数
zh_hans: 最大字符数

source: Max recommended for %@: %lld
de: Max. empfohlen für %@: %lld
es: Máx. recomendado para %@: %lld
fr: Max recommandé pour %@ : %lld
ja: %@の推奨最大: %lld
zh_hans: %@ 的推荐最大值: %lld

source: MIT License
de: MIT-Lizenz
es: Licencia MIT
fr: Licence MIT
ja: MITライセンス
zh_hans: MIT 许可证

source: On your Mac or from your iPhone (AirDrop, copy-paste)
de: Auf Ihrem Mac oder von Ihrem iPhone (AirDrop, Kopieren-Einfügen)
es: En su Mac o desde su iPhone (AirDrop, copiar-pegar)
fr: Sur votre Mac ou depuis votre iPhone (AirDrop, copier-coller)
ja: MacまたはiPhoneから（AirDrop、コピー&ペースト）
zh_hans: 在 Mac 上或从 iPhone（隔空投送、复制粘贴）

source: Quit
de: Beenden
es: Salir
fr: Quitter
ja: 終了
zh_hans: 退出

source: Scan the screen
de: Scannen Sie den Bildschirm
es: Escanee la pantalla
fr: Scannez l'écran
ja: 画面をスキャン
zh_hans: 扫描屏幕

source: ScanBar displays the code
de: ScanBar zeigt den Code an
es: ScanBar muestra el código
fr: ScanBar affiche le code
ja: ScanBarがコードを表示
zh_hans: ScanBar 显示代码

source: Scanner or camera
de: Scanner oder Kamera
es: Escáner o cámara
fr: Scanner ou appareil photo
ja: スキャナーまたはカメラ
zh_hans: 扫描仪或相机

source: The barcode or QR code appears automatically on your screen
de: Der Barcode oder QR-Code erscheint automatisch auf Ihrem Bildschirm
es: El código de barras o QR aparece automáticamente en la pantalla
fr: Le code-barres ou QR code apparaît automatiquement sur votre écran
ja: バーコードまたはQRコードが画面に自動表示されます
zh_hans: 条形码或二维码会自动显示在屏幕上

source: The on-screen code is scannable like a physical code
de: Der Code auf dem Bildschirm ist wie ein physischer Code scannbar
es: El código en pantalla se puede escanear como un código físico
fr: Le code sur l'écran est scannable comme un code physique
ja: 画面のコードは物理的なコードと同様にスキャンできます
zh_hans: 屏幕上的代码可以像实体码一样扫描

source: This window remains accessible from the menu
de: Dieses Fenster bleibt über das Menü erreichbar
es: Esta ventana sigue accesible desde el menú
fr: Cette fenêtre reste accessible depuis le menu
ja: このウィンドウはメニューからいつでも開けます
zh_hans: 此窗口可从菜单访问

source: Use your scanner or camera to scan the screen
de: Nutzen Sie Ihren Scanner oder die Kamera zum Scannen des Bildschirms
es: Use el escáner o la cámara para escanear la pantalla
fr: Utilisez votre scanner ou l'appareil photo pour flasher l'écran
ja: スキャナーまたはカメラで画面をスキャンしてください
zh_hans: 使用扫描仪或相机扫描屏幕

source: Width (px)
de: Breite (px)
es: Ancho (px)
fr: Largeur (px)
ja: 幅 (px)
zh_hans: 宽度 (px)

source: Format
es: Formato
ja: 形式
zh_hans: 格式

source: Name
es: Nombre
fr: Nom
it: Nome
ja: 名前
zh_hans: 名称

source: Version %@
es: Versión %@
ja: バージョン %@
zh_hans: 版本 %@

source: Global
it: Globale
ja: グローバル
zh_hans: 全局

source: ScanBar Menu
zh_hans: ScanBar 菜单
